{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Dense", "config": {"bias_regularizer": null, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "bias_constraint": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "units": 50, "dtype": "float32", "batch_input_shape": [null, 52622], "trainable": true}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "name": "dense_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "bias_constraint": null, "activation": "sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "units": 1, "trainable": true, "kernel_regularizer": null}}], "keras_version": "2.0.8"}